---
type: DuctFittingAndAccessoryData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 10
tags: [revit-api, class]
---

# DuctFittingAndAccessoryData

`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAllConnectorData | 2014 | `public IList < DuctFittingAndAccessoryConnectorData > GetAllConnectorData ()` |
| Method | GetEntity | 2014 | `public Entity GetEntity ()` |
| Method | GetFamilyInstanceId | 2014 | `public ElementId GetFamilyInstanceId ()` |
| Property | AirViscosity | 2014 | `public double AirViscosity { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Origin | 2014 | `public XYZ Origin { get ; }` |
| Property | PartType | 2014 | `public PartType PartType { get ; }` |
| Property | ServerGUID | 2014 | `public Guid ServerGUID { get ; }` |
| Property | SystemClassification | 2014 | `public MEPSystemClassification SystemClassification { get ; }` |